In [1]:
import numpy as np
import pandas as pd

In [13]:
df = pd.read_csv("C:/Users/user/Documents/data.csv", encoding='ISO-8859-1')
df.head()

,job_title,hh_title,age,salary,exp. period,title of exp.
0,data analyst,Data analyst,22.0,NaN,2.67,Data Analyst
1,data analyst,Data Analyst,21.0,NaN,0.83,Junior Data Analyst
2,data analyst,Data Analyst,30.0,NaN,7.50,Data Analyst
3,data analyst,Data Analyst,24.0,NaN,4.92,Data Analyst
4,data analyst,Data Analyst,27.0,450000.0,3.25,Business Intelligence Analyst

In [14]:
X = df.drop(['job_title', 'hh_title', 'title of exp.'], axis = 1)

In [15]:
y = df['job_title']

In [16]:
X

      age    salary  exp. period
0    22.0       NaN         2.67
1    21.0       NaN         0.83
2    30.0       NaN         7.50
3    24.0       NaN         4.92
4    27.0  450000.0         3.25
..    ...       ...          ...
995  51.0       NaN        25.42
996  22.0       NaN         1.58
997  42.0       NaN         9.33
998   NaN       NaN        16.08
999  19.0       NaN         0.33

[1000 rows x 3 columns]

In [17]:
y

0      data analyst
1      data analyst
2      data analyst
3      data analyst
4      data analyst
           ...
995             sql
996             sql
997             sql
998             sql
999             sql
Name: job_title, Length: 1000, dtype: object

In [18]:
from sklearn.model_selection import train_test_split
Xtrain, Xtest, ytrain, ytest = train_test_split(X, y, train_size = 0.8, stratify=y)

In [23]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [27]:
print(np.isnan(Xtrain).any())
print(np.isinf(Xtrain).any())
print(np.isnan(Xtest).any())
print(np.isinf(Xtest).any())

age             True
salary          True
exp. period    False
dtype: bool
age            False
salary         False
exp. period    False
dtype: bool
age             True
salary          True
exp. period    False
dtype: bool
age            False
salary         False
exp. period    False
dtype: bool

In [33]:
Xtrain=np.nan_to_num(Xtrain)
Xtest=np.nan_to_num(Xtest)

In [34]:
Xtrain=Xtrain.astype('float64')
Xtest=Xtest.astype('float64')

In [61]:
gnb = GaussianNB()
gnb.fit(Xtrain,ytrain)

GaussianNB()

In [63]:
y_model = gnb.predict(Xtest)
from sklearn.metrics import accuracy_score
accuracy_score(ytest, y_model)

0.34

In [64]:
from sklearn.model_selection import cross_val_score
score = cross_val_score(gnb, Xtrain, ytrain, cv=10)
score.mean()

0.33375000000000005

In [65]:
import warnings
warnings.filterwarnings('ignore')

from sklearn.neighbors import KNeighborsClassifier
knn = KNeighborsClassifier(n_neighbors=3)

In [66]:
knn.fit(Xtrain, ytrain)

KNeighborsClassifier(n_neighbors=3)

In [67]:
y_model = knn.predict(Xtest)
from sklearn.metrics import accuracy_score
accuracy_score(ytest, y_model)

0.79

In [68]:
from sklearn.model_selection import cross_val_score
score = cross_val_score(knn, Xtrain, ytrain, cv=10)
score.mean()

0.79875